tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "microsoft/mssql-release"
# Command-line interface for SQLite
brew "sqlite"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Command-line tool to interact with exercism.io
brew "exercism"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# HTTP/2 C Library
brew "nghttp2"
# Cross-shell prompt for astronauts
brew "starship"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript", link: false
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
cask "visual-studio-code"
cask "google-chrome"